ISarrz/zelenka/firmware/sdkconfig.defaults
# Defaults — `idf.py menuconfig` overrides these per developer.
CONFIG_IDF_TARGET="esp32c3"

# 4 MB flash on the Super Mini we ship.
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="4MB"

# Custom partition table — OTA-enabled (ota_0 + ota_1 + otadata + littlefs).
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# OTA rollback: validate the new image on its first boot, otherwise revert.
# The app calls esp_ota_mark_app_valid_cancel_rollback() after a successful
# samples cycle.
CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE=y

# Project version goes into the OTA app descriptor. CI/release scripts may
# override this; default uses the value committed here.
CONFIG_APP_PROJECT_VER_FROM_CONFIG=y
CONFIG_APP_PROJECT_VER="0.3.4"

# We have one task per phase, no SMP; keep main task stack roomy enough for HTTP.
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192

# Wi-Fi station — Power saving stays on (we sleep between samples anyway).
CONFIG_ESP_WIFI_ENABLE_WPA3_SAE=y

# HTTPS client is included even if we POST to plain HTTP in dev — Sprint 1 will
# switch to TLS once the server is behind Caddy.
CONFIG_ESP_TLS_USING_MBEDTLS=y
CONFIG_MBEDTLS_TLS_CLIENT=y

# Real browsers easily send 1 KB+ of request headers (Cookie + User-Agent +
# Accept-Language). The default 512 makes the captive-portal page reject
# every submit with "header fields are too long".
CONFIG_HTTPD_MAX_REQ_HDR_LEN=2048
CONFIG_HTTPD_MAX_URI_LEN=1024

# Use the system event loop default sizes — adequate for a single Wi-Fi
# connection.
